'''
Написав ще один варіант до виконання завдання №3.
'''
import re
raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
    "+49 161 71777965",   # Додав номер німецького формату, щоб перевірити, чи працює функція до кінця
]

def normalize_phone(phone_number):
    
    
    updated_number = re.sub(r"[^0-9]", "", phone_number)# Видаляємо все, крім цифр
        
    #Тут ми додаємо код країни, якщо його немає, за допомогою умовного оператора "if"
    if updated_number.startswith("380"):
        updated_number = '+' + updated_number # Тут - додали "+"
            
    elif updated_number.startswith("0"):
        updated_number = '+38' + updated_number # Тут перевіряється випадок, коли номер не починається з "380", а з "0", як деякі номери зі списку

    else:
        return "Номер не відповідає укр. формату" # Якщо номер не відповідає українському формату, виводимо ось таке повідомлення
    

    return updated_number

sanitized_numbers = [normalize_phone(num) for num in raw_numbers] # Перевіряємо функцію, як вказано в прикладі до домашнього завдання
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)
