'''
Завдання №2
Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами, 
що випали випадковим чином і в певному діапазоні під час чергового тиражу. 

Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.

Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати набір унікальних випадкових чисел для таких лотерей.

Вона буде повертати випадковий набір чисел у межах заданих параметрів, причому всі випадкові числа в наборі повинні бути унікальні.
'''
from random import randint
def get_numbers_ticket(min, max, quantity):
    num_list = [] # Створюємо список, де будемо зберігати наші значення
    while len(num_list) < quantity:
        num = randint(min, max)

        if num not in num_list: # Перевірка на дублікат чисел у списку, щоб він приймав тільки унікальні значення
            num_list.append(num)

    return num_list

# Перевіряємо функцію
print(get_numbers_ticket(1, 159, 4))

'''
Потім прочитав і згадав, що також можна це було зробити за допомогою random.sample(range(min, max + 1), quantity). Це набагато практичніше
'''

